micropython/micropython/ports/esp8266/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP module"
#define MICROPY_HW_MCU_NAME "ESP8266"
